reports/local_2ser_500tunn_20inst_1000batch_500user.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: tunnels.js
     output: -

  scenarios: (100.00%) 1 scenario, 500 max VUs, 1m30s max duration (incl. graceful stop):
           * thousand-vus: 500 looping VUs for 1m0s (gracefulStop: 30s)


running (0m00.9s), 500/500 VUs, 0 complete and 0 interrupted iterations
thousand-vus   [   2% ] 500 VUs  0m00.9s/1m0s

running (0m01.9s), 500/500 VUs, 0 complete and 0 interrupted iterations
thousand-vus   [   3% ] 500 VUs  0m01.9s/1m0s

running (0m02.9s), 500/500 VUs, 0 complete and 0 interrupted iterations
thousand-vus   [   5% ] 500 VUs  0m02.9s/1m0s

running (0m03.9s), 500/500 VUs, 11 complete and 0 interrupted iterations
thousand-vus   [   7% ] 500 VUs  0m03.9s/1m0s

running (0m04.9s), 500/500 VUs, 105 complete and 0 interrupted iterations
thousand-vus   [   8% ] 500 VUs  0m04.9s/1m0s

running (0m05.9s), 500/500 VUs, 317 complete and 0 interrupted iterations
thousand-vus   [  10% ] 500 VUs  0m05.9s/1m0s

running (0m06.9s), 500/500 VUs, 757 complete and 0 interrupted iterations
thousand-vus   [  12% ] 500 VUs  0m06.9s/1m0s

running (0m07.9s), 500/500 VUs, 1134 complete and 0 interrupted iterations
thousand-vus   [  13% ] 500 VUs  0m07.9s/1m0s

running (0m08.9s), 500/500 VUs, 1408 complete and 0 interrupted iterations
thousand-vus   [  15% ] 500 VUs  0m08.9s/1m0s

running (0m09.9s), 500/500 VUs, 1685 complete and 0 interrupted iterations
thousand-vus   [  17% ] 500 VUs  0m09.9s/1m0s

running (0m10.9s), 500/500 VUs, 1879 complete and 0 interrupted iterations
thousand-vus   [  18% ] 500 VUs  0m10.9s/1m0s

running (0m11.9s), 500/500 VUs, 2069 complete and 0 interrupted iterations
thousand-vus   [  20% ] 500 VUs  0m11.9s/1m0s

running (0m12.9s), 500/500 VUs, 2272 complete and 0 interrupted iterations
thousand-vus   [  22% ] 500 VUs  0m12.9s/1m0s

running (0m13.9s), 500/500 VUs, 2423 complete and 0 interrupted iterations
thousand-vus   [  23% ] 500 VUs  0m13.9s/1m0s

running (0m14.9s), 500/500 VUs, 2579 complete and 0 interrupted iterations
thousand-vus   [  25% ] 500 VUs  0m14.9s/1m0s

running (0m15.9s), 500/500 VUs, 2762 complete and 0 interrupted iterations
thousand-vus   [  27% ] 500 VUs  0m15.9s/1m0s

running (0m16.9s), 500/500 VUs, 2936 complete and 0 interrupted iterations
thousand-vus   [  28% ] 500 VUs  0m16.9s/1m0s

running (0m17.9s), 500/500 VUs, 3104 complete and 0 interrupted iterations
thousand-vus   [  30% ] 500 VUs  0m17.9s/1m0s

running (0m18.9s), 500/500 VUs, 3262 complete and 0 interrupted iterations
thousand-vus   [  32% ] 500 VUs  0m18.9s/1m0s

running (0m19.9s), 500/500 VUs, 3429 complete and 0 interrupted iterations
thousand-vus   [  33% ] 500 VUs  0m19.9s/1m0s

running (0m20.9s), 500/500 VUs, 3608 complete and 0 interrupted iterations
thousand-vus   [  35% ] 500 VUs  0m20.9s/1m0s

running (0m21.9s), 500/500 VUs, 3728 complete and 0 interrupted iterations
thousand-vus   [  37% ] 500 VUs  0m21.9s/1m0s

running (0m22.9s), 500/500 VUs, 3895 complete and 0 interrupted iterations
thousand-vus   [  38% ] 500 VUs  0m22.9s/1m0s

running (0m23.9s), 500/500 VUs, 4008 complete and 0 interrupted iterations
thousand-vus   [  40% ] 500 VUs  0m23.9s/1m0s

running (0m24.9s), 500/500 VUs, 4122 complete and 0 interrupted iterations
thousand-vus   [  42% ] 500 VUs  0m24.9s/1m0s

running (0m25.9s), 500/500 VUs, 4237 complete and 0 interrupted iterations
thousand-vus   [  43% ] 500 VUs  0m25.9s/1m0s

running (0m26.9s), 500/500 VUs, 4395 complete and 0 interrupted iterations
thousand-vus   [  45% ] 500 VUs  0m26.9s/1m0s

running (0m27.9s), 500/500 VUs, 4584 complete and 0 interrupted iterations
thousand-vus   [  47% ] 500 VUs  0m27.9s/1m0s

running (0m28.9s), 500/500 VUs, 4750 complete and 0 interrupted iterations
thousand-vus   [  48% ] 500 VUs  0m28.9s/1m0s

running (0m29.9s), 500/500 VUs, 4923 complete and 0 interrupted iterations
thousand-vus   [  50% ] 500 VUs  0m29.9s/1m0s

running (0m30.9s), 500/500 VUs, 5112 complete and 0 interrupted iterations
thousand-vus   [  52% ] 500 VUs  0m30.9s/1m0s

running (0m31.9s), 500/500 VUs, 5301 complete and 0 interrupted iterations
thousand-vus   [  53% ] 500 VUs  0m31.9s/1m0s

running (0m32.9s), 500/500 VUs, 5427 complete and 0 interrupted iterations
thousand-vus   [  55% ] 500 VUs  0m32.9s/1m0s

running (0m33.9s), 500/500 VUs, 5587 complete and 0 interrupted iterations
thousand-vus   [  57% ] 500 VUs  0m33.9s/1m0s

running (0m34.9s), 500/500 VUs, 5745 complete and 0 interrupted iterations
thousand-vus   [  58% ] 500 VUs  0m34.9s/1m0s

running (0m35.9s), 500/500 VUs, 5884 complete and 0 interrupted iterations
thousand-vus   [  60% ] 500 VUs  0m35.9s/1m0s

running (0m36.9s), 500/500 VUs, 6012 complete and 0 interrupted iterations
thousand-vus   [  62% ] 500 VUs  0m36.9s/1m0s

running (0m37.9s), 500/500 VUs, 6190 complete and 0 interrupted iterations
thousand-vus   [  63% ] 500 VUs  0m37.9s/1m0s

running (0m38.9s), 500/500 VUs, 6349 complete and 0 interrupted iterations
thousand-vus   [  65% ] 500 VUs  0m38.9s/1m0s

running (0m39.9s), 500/500 VUs, 6545 complete and 0 interrupted iterations
thousand-vus   [  67% ] 500 VUs  0m39.9s/1m0s

running (0m40.9s), 500/500 VUs, 6735 complete and 0 interrupted iterations
thousand-vus   [  68% ] 500 VUs  0m40.9s/1m0s

running (0m41.9s), 500/500 VUs, 6920 complete and 0 interrupted iterations
thousand-vus   [  70% ] 500 VUs  0m41.9s/1m0s

running (0m42.9s), 500/500 VUs, 7140 complete and 0 interrupted iterations
thousand-vus   [  72% ] 500 VUs  0m42.9s/1m0s

running (0m43.9s), 500/500 VUs, 7332 complete and 0 interrupted iterations
thousand-vus   [  73% ] 500 VUs  0m43.9s/1m0s

running (0m44.9s), 500/500 VUs, 7521 complete and 0 interrupted iterations
thousand-vus   [  75% ] 500 VUs  0m44.9s/1m0s

running (0m45.9s), 500/500 VUs, 7719 complete and 0 interrupted iterations
thousand-vus   [  77% ] 500 VUs  0m45.9s/1m0s

running (0m46.9s), 500/500 VUs, 7925 complete and 0 interrupted iterations
thousand-vus   [  78% ] 500 VUs  0m46.9s/1m0s

running (0m47.9s), 500/500 VUs, 8135 complete and 0 interrupted iterations
thousand-vus   [  80% ] 500 VUs  0m47.9s/1m0s

running (0m48.9s), 500/500 VUs, 8327 complete and 0 interrupted iterations
thousand-vus   [  82% ] 500 VUs  0m48.9s/1m0s

running (0m49.9s), 500/500 VUs, 8542 complete and 0 interrupted iterations
thousand-vus   [  83% ] 500 VUs  0m49.9s/1m0s

running (0m50.9s), 500/500 VUs, 8735 complete and 0 interrupted iterations
thousand-vus   [  85% ] 500 VUs  0m50.9s/1m0s

running (0m51.9s), 500/500 VUs, 8931 complete and 0 interrupted iterations
thousand-vus   [  87% ] 500 VUs  0m51.9s/1m0s

running (0m52.9s), 500/500 VUs, 9131 complete and 0 interrupted iterations
thousand-vus   [  88% ] 500 VUs  0m52.9s/1m0s

running (0m53.9s), 500/500 VUs, 9328 complete and 0 interrupted iterations
thousand-vus   [  90% ] 500 VUs  0m53.9s/1m0s

running (0m54.9s), 500/500 VUs, 9548 complete and 0 interrupted iterations
thousand-vus   [  92% ] 500 VUs  0m54.9s/1m0s

running (0m55.9s), 500/500 VUs, 9769 complete and 0 interrupted iterations
thousand-vus   [  93% ] 500 VUs  0m55.9s/1m0s

running (0m56.9s), 500/500 VUs, 9946 complete and 0 interrupted iterations
thousand-vus   [  95% ] 500 VUs  0m56.9s/1m0s

running (0m57.9s), 500/500 VUs, 10124 complete and 0 interrupted iterations
thousand-vus   [  97% ] 500 VUs  0m57.9s/1m0s

running (0m58.9s), 500/500 VUs, 10304 complete and 0 interrupted iterations
thousand-vus   [  98% ] 500 VUs  0m58.9s/1m0s

running (0m59.9s), 500/500 VUs, 10504 complete and 0 interrupted iterations
thousand-vus   [ 100% ] 500 VUs  0m59.9s/1m0s

running (1m00.9s), 321/500 VUs, 10706 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m01.9s), 202/500 VUs, 10825 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m02.9s), 174/500 VUs, 10853 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m03.9s), 148/500 VUs, 10879 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m04.9s), 130/500 VUs, 10897 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m05.9s), 103/500 VUs, 10924 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m06.9s), 092/500 VUs, 10935 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m07.9s), 079/500 VUs, 10948 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m08.9s), 070/500 VUs, 10957 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m09.9s), 046/500 VUs, 10981 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m10.9s), 033/500 VUs, 10994 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m11.9s), 028/500 VUs, 10999 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m12.9s), 020/500 VUs, 11007 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m13.9s), 011/500 VUs, 11016 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m14.9s), 009/500 VUs, 11018 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m15.9s), 008/500 VUs, 11019 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m16.9s), 006/500 VUs, 11021 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m17.9s), 006/500 VUs, 11021 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m18.9s), 006/500 VUs, 11021 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m19.9s), 005/500 VUs, 11022 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m20.9s), 005/500 VUs, 11022 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m21.9s), 004/500 VUs, 11023 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m22.9s), 004/500 VUs, 11023 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m23.9s), 004/500 VUs, 11023 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m24.9s), 004/500 VUs, 11023 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m25.9s), 004/500 VUs, 11023 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m26.9s), 004/500 VUs, 11023 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m27.9s), 002/500 VUs, 11025 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m28.9s), 002/500 VUs, 11025 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m29.9s), 002/500 VUs, 11025 complete and 0 interrupted iterations
thousand-vus ↓ [ 100% ] 500 VUs  1m0s

running (1m30.0s), 000/500 VUs, 11025 complete and 2 interrupted iterations
thousand-vus ✓ [ 100% ] 500 VUs  1m0s

     ✗ status is 200
      ↳  55% — ✓ 6126 / ✗ 4899

     checks.........................: 55.56% ✓ 6126       ✗ 4899 
     data_received..................: 40 MB  439 kB/s
     data_sent......................: 5.0 MB 55 kB/s
     http_req_blocked...............: avg=355.19ms min=0s       med=247.87ms max=10.54s   p(90)=513.61ms p(95)=1.03s   
     http_req_connecting............: avg=100.62ms min=0s       med=118.67ms max=379.4ms  p(90)=226.14ms p(95)=260.51ms
     http_req_duration..............: avg=1.25s    min=0s       med=251.95ms max=54.77s   p(90)=3.61s    p(95)=10.21s  
       { expected_response:true }...: avg=811.53ms min=237.27ms med=285.48ms max=43.43s   p(90)=2.61s    p(95)=3.61s   
     http_req_failed................: 44.43% ✓ 4899       ✗ 6126 
     http_req_receiving.............: avg=333.8µs  min=0s       med=42.33µs  max=112.96ms p(90)=201.1µs  p(95)=881.96µs
     http_req_sending...............: avg=171.82µs min=0s       med=105.39µs max=51.09ms  p(90)=305.81µs p(95)=389.3µs 
     http_req_tls_handshaking.......: avg=139.81ms min=0s       med=126.53ms max=2.09s    p(90)=257.8ms  p(95)=314.29ms
     http_req_waiting...............: avg=1.25s    min=0s       med=251.59ms max=54.77s   p(90)=3.61s    p(95)=10.21s  
     http_reqs......................: 11025  122.495903/s
     iteration_duration.............: avg=2.86s    min=1s       med=1.53s    max=56.06s   p(90)=6.44s    p(95)=11.52s  
     iterations.....................: 11025  122.495903/s
     vus............................: 2      min=2        max=500
     vus_max........................: 500    min=500      max=500